//========================================
//<--预定义处理，防止重复定义-->
#ifndef _stm32f10x_it_H
#define _stm32f10x_it_H

//========================================
//头文件





//========================================
//宏定义




//========================================
//端口定义




//========================================
//外调变量声明





//========================================
//外调函数声明
extern void USART1_IRQHandler(void);        //UART_COM1串口中断处理程序
extern void USART2_IRQHandler(void);				//UART_COM2串口中断处理程序





//========================================
//<--预处理结束-->
#endif



